import './MainPage.css';

const MainPage = () => {
    return (
        <div className="container">
            <h2>Мои фото</h2>
            <div className="img_wrapper">
                <img src="../../resources/photo1.jpg" alt="Последнее селфи" />
                <img src="../../resources/photo2.jpg" alt="Фото из старшей школы" />
            </div>
            <h2>Моя история</h2>
            <p>
                Когда я впервые познакомился с миром программирования, это было просто
                случайностью. Меня всегда привлекала технология и компьютеры, но я никогда
                не считал себя техническим экспертом или человеком, способным разбираться
                с программированием. Однако, однажды, когда я учился в университете, мне
                потребовалось выполнить небольшой проект для одного из курсов. Это была
                задача по разработке простой веб-страницы с использованием HTML и CSS.
                Честно говоря, я чувствовал себя неуверенно, но решил попробовать. Со
                страхом и надеждой, я приступил к написанию кода. И, о чудо, я был поражен
                тем, как мощный и креативный мир открылся передо мной. Это было как
                волшебство - писать строки кода и видеть, как моя идея превращается в
                живую и функциональную веб-страницу. Я был восхищен тем, каким образом я
                могу контролировать внешний вид и поведение элементов на странице, просто
                изменяя пару символов в коде. Этот первый опыт открыл для меня дверь в мир
                программирования. Я стал углубляться в изучение языков программирования,
                таких как JavaScript и Python. Каждая новая концепция, которую я учил,
                приносила радость и желание узнать еще больше. Вскоре я начал создавать
                собственные проекты. Я создавал веб-приложения, мобильные приложения и
                игры. Каждый проект представлял собой увлекательный вызов и возможность
                для саморазвития. Программирование дало мне инструмент, который позволил
                мне воплощать свои идеи в реальность. Я научился разбираться с сложными
                задачами, разрабатывать эффективные решения и находить креативные подходы
                к решению проблем. Но, что самое важное, программирование стало для меня
                не просто набором технических навыков, а способом мышления. Я научился
                разбираться в сложных вопросах, декомпозировать проблемы на меньшие части
                и строить логические цепочки решений. Этот новый способ мышления стал
                неотъемлемой частью моей жизни и применим в различных аспектах. Со
                временем, программирование перестало быть просто хобби. Это стало моим
                способом творчества, самовыражения и развития. Я понял, что это нечто
                большее, чем просто технические навыки - это новая форма творчества,
                которая объединяет технологию и искусство. И так, программирование стало
                для меня не только любимым занятием, но и источником вдохновения и смысла.
                Я увлеченно продолжаю свой путь в этом удивительном мире, всегда готовый
                узнавать новое и делиться своими знаниями с другими. Программирование дало
                мне возможность не просто использовать технологию, но и вносить свой вклад
                в создание чего-то прекрасного для мира.
            </p>
        </div>
    );
};

export default MainPage;
